[
  {
    "__typename": "Job",
    "id": "cm3wkq8cfssir07n1qjbfigb4",
    "title": "Quran Teachers (Part Time)",
    "postedDate": "2024-11-01",
    "description": {
      "__typename": "RichText",
      "html": "<p>We are seeking passionate and knowledgeable Quran Teachers to join our team in a part-time capacity. The ideal candidates will have a deep understanding of the Quran, a commitment to Islamic education, and the ability to inspire students in their spiritual development.</p><p><strong>Responsibilities</strong>:</p><ul><li><div>Teach Quran recitation, memorization (Hifz), and Tafsir (interpretation) to students of varying age groups and skill levels.</div></li><li><div>Ensure students understand the proper pronunciation (Tajweed) and memorization techniques.</div></li><li><div>Provide support for students in their Quranic studies, offering additional help as needed.</div></li><li><div>Create and implement engaging lesson plans that promote both spiritual growth and academic achievement.</div></li><li><div>Assess student progress and provide feedback to students and parents.</div></li><li><div>Foster a respectful and positive classroom environment that encourages learning.</div></li><li><div>Participate in school events, meetings, and professional development opportunities.</div></li></ul><p><strong>Qualifications</strong>:</p><ul><li><div>Strong knowledge of the Quran and Islamic teachings.</div></li><li><div>Proficiency in Tajweed and Quranic recitation.</div></li><li><div>Previous teaching experience in an Islamic setting is preferred but not required.</div></li><li><div>Ability to work well with students, parents, and staff in a collaborative environment.</div></li><li><div>Strong communication and organizational skills.</div></li><li><div>A degree or certification in Islamic studies or Quranic studies is a plus.</div></li><li><div>Fluency in Arabic is preferred.</div></li></ul><p><strong>How to Apply</strong>:<br>Please send your resume, along with a brief cover letter outlining your experience and passion for teaching the Quran, to <strong>info@oiacedmonton.ca</strong>.</p><p>We look forward to welcoming dedicated educators to our team who shares our commitment to excellence in both academics and Islamic values.</p>"
    },
    "requireAlbertaCertification": null
  },
  {
    "__typename": "Job",
    "id": "cm3wkxvslina307n0ieefbw5p",
    "title": "Academic Teachers (Part Time)",
    "postedDate": "2024-11-01",
    "description": {
      "__typename": "RichText",
      "html": "<p>We are looking for passionate, qualified, and dedicated part-time Academic Teachers to join our team. The ideal candidates will be committed to delivering high-quality education while integrating Islamic values into the curriculum.</p><p><strong>Responsibilities</strong>:</p><ul><li><div>Teach [Subject(s) you will be teaching, e.g., Math, English, Science, Social Studies, etc.] to students in various grade levels.</div></li><li><div>Develop and implement lesson plans that align with both the school curriculum and Islamic principles.</div></li><li><div>Foster a positive and engaging classroom environment that promotes active learning and student participation.</div></li><li><div>Assess student progress through assignments, quizzes, exams, and provide constructive feedback.</div></li><li><div>Support students’ academic and personal development, ensuring they are well-prepared for future academic success.</div></li><li><div>Communicate regularly with parents and guardians about student progress and any issues that may arise.</div></li><li><div>Participate in school events, faculty meetings, and professional development programs.</div></li></ul><p><strong>Qualifications</strong>:</p><ul><li><div>A degree in Education or a relevant academic field (e.g., Math, Science, English, etc.).</div></li><li><div>Prior teaching experience in an academic setting is preferred but not required.</div></li><li><div>A passion for education and working with young people.</div></li><li><div>Strong classroom management skills and the ability to maintain a respectful and productive learning environment.</div></li><li><div>Familiarity with integrating Islamic values into the academic curriculum is a plus.</div></li><li><div>Excellent communication, organizational, and interpersonal skills.</div></li><li><div>Fluency in English is preferred.</div></li></ul><p><strong>How to Apply</strong>:<br>Interested candidates should submit their resume, along with a cover letter outlining their qualifications and teaching philosophy, to <strong>info@oiacedmonton.ca</strong>.</p><p>We are excited to welcome dedicated and passionate teachers who will contribute to the academic excellence and Islamic development of our students.</p>"
    },
    "requireAlbertaCertification": null
  },
  {
    "__typename": "Job",
    "id": "cmapyxtlthv3307mziil98wfv",
    "title": "Elementary Teacher (Full Time)",
    "postedDate": "2025-05-15",
    "description": {
      "__typename": "RichText",
      "html": "<h2><strong>Inspire young hearts, illuminate bright minds and shape the leaders of tomorrow with Islam &amp; Academics</strong></h2><h2><strong>About Omar Ibn Al-Khattab Academy (OIAA) </strong></h2><p>At OIAA, Islamic values are at the heart of everything we do. </p><p>We believe education is a sacred trust one that connects home, school, and the wider ummah. Our commitment to strong academics is inseparable from our dedication to fostering spiritually grounded, intellectually curious, and morally upright students.</p><p>We are seeking passionate, knowledgeable, and values driven educators who reflect the diverse families we serve and who are committed to upholding the principles of Islamic education alongside academic rigor.</p><h2><strong>Position Overview - Elementary Teacher(s), Grade KG-6</strong></h2><p>We are seeking an enthusiastic and dynamic elementary grade Teacher(s) to join our team. The ideal candidate will have the ability to create an engaging classroom environment, have a strong commitment to student learning and be inspired by teaching young learners from am Islamic centred point of view. This role involves planning and creatively delivering Alberta curriculum-aligned lessons that cater to diverse learning styles while building a supportive and collaborative classroom community.</p><h2><strong>Education/Qualifications</strong></h2><p>The ideal candidate will possess:</p><ul><li><div><p>A valid Alberta Teaching Certificate (Interim or Permanent)</p></div></li><li><div><p>A Bachelor of Education degree from a recognized institution</p></div></li><li><div><p>Demonstrated ability to create inclusive, high-performing learning environments rooted in Islamic values</p></div></li><li><div><p>Strong classroom management skills and a commitment to student well-being</p></div></li><li><div><p>Excellent communication skills (verbal and written)</p></div></li><li><div><p>Commitment to professional growth and ongoing learning</p></div></li><li><div><p>Works collaboratively with parents and administration.</p></div></li><li><div><p>Deep respect for Islamic teachings, with the ability to integrate Islamic principles into daily teaching and school culture</p></div></li><li><div><p>Participate in various staff meetings, professional development and other extra-curricular activities</p></div></li><li><div><p>A clear criminal record check, including a vulnerable sector search</p></div></li><li><div><p>Familiarity with the Alberta curriculum and a desire to inspire students to achieve both academically and spiritually</p></div></li></ul><h2><strong>Hours:</strong></h2><ul><li><div><p>Approx. 1.00 FTE – Mondays to Fridays, full time</p></div></li></ul><h2><strong>Compensation:</strong></h2><ul><li><div><p>Based on Experience and Education. <a target='_blank' title=\"OIAA Salarary Grid.\" href=\"https://drive.google.com/file/d/1s9yCquBxykKmXX1o6e3747AqYX9nM1XL/view?usp=sharing\"><u>Click here for the salary grid. </u></a></p></div></li></ul><h2><strong>Deadline for applications:</strong></h2><p>Closing date for this competition is June 30, 2025</p><p>Send resume and cover letter to info@oiacedmonton.ca</p><p><em>*Thank you for your interest in this position. Only those selected for an interview will be contacted.</em></p>"
    },
    "requireAlbertaCertification": true
  }
]