{
  "title": "Academic Teachers (Part Time)",
  "postedDate": "2024-11-01",
  "description": "<p>We are looking for passionate, qualified, and dedicated part-time Academic Teachers to join our team. The ideal candidates will be committed to delivering high-quality education while integrating Islamic values into the curriculum.</p><p><strong>Responsibilities</strong>:</p><ul><li><div>Teach [Subject(s) you will be teaching, e.g., Math, English, Science, Social Studies, etc.] to students in various grade levels.</div></li><li><div>Develop and implement lesson plans that align with both the school curriculum and Islamic principles.</div></li><li><div>Foster a positive and engaging classroom environment that promotes active learning and student participation.</div></li><li><div>Assess student progress through assignments, quizzes, exams, and provide constructive feedback.</div></li><li><div>Support students’ academic and personal development, ensuring they are well-prepared for future academic success.</div></li><li><div>Communicate regularly with parents and guardians about student progress and any issues that may arise.</div></li><li><div>Participate in school events, faculty meetings, and professional development programs.</div></li></ul><p><strong>Qualifications</strong>:</p><ul><li><div>A degree in Education or a relevant academic field (e.g., Math, Science, English, etc.).</div></li><li><div>Prior teaching experience in an academic setting is preferred but not required.</div></li><li><div>A passion for education and working with young people.</div></li><li><div>Strong classroom management skills and the ability to maintain a respectful and productive learning environment.</div></li><li><div>Familiarity with integrating Islamic values into the academic curriculum is a plus.</div></li><li><div>Excellent communication, organizational, and interpersonal skills.</div></li><li><div>Fluency in English is preferred.</div></li></ul><p><strong>How to Apply</strong>:<br>Interested candidates should submit their resume, along with a cover letter outlining their qualifications and teaching philosophy, to <strong>info@oiacedmonton.ca</strong>.</p><p>We are excited to welcome dedicated and passionate teachers who will contribute to the academic excellence and Islamic development of our students.</p>",
  "requireAlbertaCertification": null,
  "active": true
}