{
  "title": "Elementary Teacher (Full Time)",
  "postedDate": "2025-05-15",
  "description": "<h2><strong>Inspire young hearts, illuminate bright minds and shape the leaders of tomorrow with Islam &amp; Academics</strong></h2><h2><strong>About Omar Ibn Al-Khattab Academy (OIAA) </strong></h2><p>At OIAA, Islamic values are at the heart of everything we do. </p><p>We believe education is a sacred trust one that connects home, school, and the wider ummah. Our commitment to strong academics is inseparable from our dedication to fostering spiritually grounded, intellectually curious, and morally upright students.</p><p>We are seeking passionate, knowledgeable, and values driven educators who reflect the diverse families we serve and who are committed to upholding the principles of Islamic education alongside academic rigor.</p><h2><strong>Position Overview - Elementary Teacher(s), Grade KG-6</strong></h2><p>We are seeking an enthusiastic and dynamic elementary grade Teacher(s) to join our team. The ideal candidate will have the ability to create an engaging classroom environment, have a strong commitment to student learning and be inspired by teaching young learners from am Islamic centred point of view. This role involves planning and creatively delivering Alberta curriculum-aligned lessons that cater to diverse learning styles while building a supportive and collaborative classroom community.</p><h2><strong>Education/Qualifications</strong></h2><p>The ideal candidate will possess:</p><ul><li><div><p>A valid Alberta Teaching Certificate (Interim or Permanent)</p></div></li><li><div><p>A Bachelor of Education degree from a recognized institution</p></div></li><li><div><p>Demonstrated ability to create inclusive, high-performing learning environments rooted in Islamic values</p></div></li><li><div><p>Strong classroom management skills and a commitment to student well-being</p></div></li><li><div><p>Excellent communication skills (verbal and written)</p></div></li><li><div><p>Commitment to professional growth and ongoing learning</p></div></li><li><div><p>Works collaboratively with parents and administration.</p></div></li><li><div><p>Deep respect for Islamic teachings, with the ability to integrate Islamic principles into daily teaching and school culture</p></div></li><li><div><p>Participate in various staff meetings, professional development and other extra-curricular activities</p></div></li><li><div><p>A clear criminal record check, including a vulnerable sector search</p></div></li><li><div><p>Familiarity with the Alberta curriculum and a desire to inspire students to achieve both academically and spiritually</p></div></li></ul><h2><strong>Hours:</strong></h2><ul><li><div><p>Approx. 1.00 FTE – Mondays to Fridays, full time</p></div></li></ul><h2><strong>Compensation:</strong></h2><ul><li><div><p>Based on Experience and Education. <a target='_blank' title=\"OIAA Salarary Grid.\" href=\"https://drive.google.com/file/d/1s9yCquBxykKmXX1o6e3747AqYX9nM1XL/view?usp=sharing\"><u>Click here for the salary grid. </u></a></p></div></li></ul><h2><strong>Deadline for applications:</strong></h2><p>Closing date for this competition is June 30, 2025</p><p>Send resume and cover letter to info@oiacedmonton.ca</p><p><em>*Thank you for your interest in this position. Only those selected for an interview will be contacted.</em></p>",
  "requireAlbertaCertification": true,
  "active": true
}