{
  "title": "Quran Teachers (Part Time)",
  "postedDate": "2024-11-01",
  "description": "<p>We are seeking passionate and knowledgeable Quran Teachers to join our team in a part-time capacity. The ideal candidates will have a deep understanding of the Quran, a commitment to Islamic education, and the ability to inspire students in their spiritual development.</p><p><strong>Responsibilities</strong>:</p><ul><li><div>Teach Quran recitation, memorization (Hifz), and Tafsir (interpretation) to students of varying age groups and skill levels.</div></li><li><div>Ensure students understand the proper pronunciation (Tajweed) and memorization techniques.</div></li><li><div>Provide support for students in their Quranic studies, offering additional help as needed.</div></li><li><div>Create and implement engaging lesson plans that promote both spiritual growth and academic achievement.</div></li><li><div>Assess student progress and provide feedback to students and parents.</div></li><li><div>Foster a respectful and positive classroom environment that encourages learning.</div></li><li><div>Participate in school events, meetings, and professional development opportunities.</div></li></ul><p><strong>Qualifications</strong>:</p><ul><li><div>Strong knowledge of the Quran and Islamic teachings.</div></li><li><div>Proficiency in Tajweed and Quranic recitation.</div></li><li><div>Previous teaching experience in an Islamic setting is preferred but not required.</div></li><li><div>Ability to work well with students, parents, and staff in a collaborative environment.</div></li><li><div>Strong communication and organizational skills.</div></li><li><div>A degree or certification in Islamic studies or Quranic studies is a plus.</div></li><li><div>Fluency in Arabic is preferred.</div></li></ul><p><strong>How to Apply</strong>:<br>Please send your resume, along with a brief cover letter outlining your experience and passion for teaching the Quran, to <strong>info@oiacedmonton.ca</strong>.</p><p>We look forward to welcoming dedicated educators to our team who shares our commitment to excellence in both academics and Islamic values.</p>",
  "requireAlbertaCertification": null,
  "active": true
}